# MAD-YOLO Final Architecture
# Backbone: RLConv (Baseline) | Head: MAD-DWConv (Proposal)

nc: 53
scales:
  n: [0.33, 0.25, 1024]

# Backbone (Matches your image's green blocks)
backbone:
  - [-1, 1, Conv, [64, 3, 2]]  # 0
  - [-1, 1, Conv, [128, 3, 2]] # 1
  - [-1, 3, RLConv, [128]]     # 2 (RLConv replaces C2f)
  - [-1, 1, Conv, [256, 3, 2]] # 3
  - [-1, 6, RLConv, [256]]     # 4 (RLConv replaces C2f)
  - [-1, 1, Conv, [512, 3, 2]] # 5
  - [-1, 6, RLConv, [512]]     # 6 (RLConv replaces C2f)
  - [-1, 1, Conv, [1024, 3, 2]] # 7
  - [-1, 3, RLConv, [1024]]    # 8 (RLConv replaces C2f)
  - [-1, 1, SPPF, [1024, 5]]   # 9

# Head (Matches your image's pink MAD-DWConv blocks)
head:
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 6], 1, Concat, [1]] 
  - [-1, 3, MAD_DWConv, [512]] # 12 (Replaces C2f with MAD-DWConv)

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 4], 1, Concat, [1]] 
  - [-1, 3, MAD_DWConv, [256]] # 15 (Replaces C2f with MAD-DWConv)

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 12], 1, Concat, [1]] 
  - [-1, 3, MAD_DWConv, [512]] # 18 (Replaces C2f with MAD-DWConv)

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 9], 1, Concat, [1]] 
  - [-1, 3, MAD_DWConv, [1024]] # 21 (Replaces C2f with MAD-DWConv)

  - [[15, 18, 21], 1, Detect, [nc]]